# GenericIsMetal Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Generic..::..GenericIsMetal Property
Generic Class See Also
---
The property labeled "Highlights" from the "Generic" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string GenericIsMetal { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GenericIsMetal As String
	Get
```

Visual C++
---
```text
public:
static property String^ GenericIsMetal {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyBoolean".
# See Also
Generic Class
Autodesk.Revit.DB.Visual Namespace